<a href="https://colab.research.google.com/github/jimaguere/Electiva_1/blob/main/class.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [14]:

from google.colab import drive
drive.mount('/content/drive')

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

In [15]:
import joblib 

#cargo modelo

modelo=joblib.load("/content/drive/MyDrive/ELECTIVA 1/modelo_arbol.dat")
columnas=joblib.load("/content/drive/MyDrive/ELECTIVA 1/columnas.dat")

In [16]:
import pandas as pd
import numpy as np

datos=pd.read_csv("/content/drive/MyDrive/ELECTIVA 1/evaluacion.csv",sep="|")
datos.head()

   cod_alumno  sexo_f  puntaje_ingreso  ...  edad_reporte  anio_reporte  clase
0        7644       0            63.14  ...          48.0        2018.0    NaN
1    22155233       0            46.35  ...          33.0        2018.0    NaN
2    23033258       0            53.65  ...          39.0        2018.0    NaN
3    23038230       0            43.40  ...          36.0        2018.0    NaN
4    23038265       1             0.00  ...          33.0        2018.0    NaN

[5 rows x 36 columns]

In [17]:
display(datos.isnull().sum())

cod_alumno                        0
sexo_f                            0
puntaje_ingreso                   0
promedio_notas                    1
total_creditos_logrados           1
biologia                          3
matematicas                       3
filosofia                         3
fisica                            3
historia                          3
quimica                           4
lenguaje                          4
geografia                         4
idiomas                           5
sociales                         13
lecturacritica                  129
ciencias                        129
razonamiento                    129
competenciaciud                 129
valor_matricula                  11
valor_servicios                  11
ingresos                         11
vive_familia                      0
estrato                          12
estrato_vivira                   12
actualmente_trabaja               4
valor_matric_colegio              4
ano_pago_colegio                 11
ingresos_familiares               4
ano_ingresos                     11
numero_aportantes                11
numero_hermanos                   4
numero_hermanos_est_superior      4
edad_reporte                      0
anio_reporte                      0
clase                           264
dtype: int64

In [18]:
datos.fillna(value=-99,inplace=True)

In [19]:
display(datos.isnull().sum())

cod_alumno                      0
sexo_f                          0
puntaje_ingreso                 0
promedio_notas                  0
total_creditos_logrados         0
biologia                        0
matematicas                     0
filosofia                       0
fisica                          0
historia                        0
quimica                         0
lenguaje                        0
geografia                       0
idiomas                         0
sociales                        0
lecturacritica                  0
ciencias                        0
razonamiento                    0
competenciaciud                 0
valor_matricula                 0
valor_servicios                 0
ingresos                        0
vive_familia                    0
estrato                         0
estrato_vivira                  0
actualmente_trabaja             0
valor_matric_colegio            0
ano_pago_colegio                0
ingresos_familiares             0
ano_ingresos                    0
numero_aportantes               0
numero_hermanos                 0
numero_hermanos_est_superior    0
edad_reporte                    0
anio_reporte                    0
clase                           0
dtype: int64

In [22]:
clase_pred=modelo.predict(datos[columnas])

In [23]:
datos['predict']=clase_pred

In [24]:
datos[['cod_alumno','predict']].head()

   cod_alumno  predict
0        7644        1
1    22155233        1
2    23033258        1
3    23038230        0
4    23038265        0

In [25]:
df_class=datos[['cod_alumno','predict']]

In [26]:
df_class

     cod_alumno  predict
0          7644        1
1      22155233        1
2      23033258        1
3      23038230        0
4      23038265        0
..          ...      ...
259  2141511053        0
260  2141511059        0
261  2141601024        0
262  2141601268        0
263  2141601270        0

[264 rows x 2 columns]

In [27]:
df_class.to_csv("/content/drive/MyDrive/ELECTIVA 1/guerrero_mateo.csv",sep="|")